#+BEGIN_COMMENT
.. title: A Look At ggplot
.. slug: a-look-at-ggplot
.. date: 2021-12-13 14:34:19 UTC-08:00
.. tags: ggplot,r,visualization
.. category: Visualization
.. link: 
.. description: A look at ggplot.
.. type: text
.. has_math: true
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ggplot-lesson

** Renaming Some Columns
#+begin_src R :results output :exports both
mpg <- mpg %>%
  rename(
    displacement=displ,
    cylinders=cyl,
    transmission=trans,
    drive_train=drv,
    city_mpg=cty,
    highway_mpg=hwy,
    fuel_type=fl,
    )

str(mpg)
#+end_src

#+RESULTS:
#+begin_example
tibble [234 × 11] (S3: tbl_df/tbl/data.frame)
 $ manufacturer: chr [1:234] "audi" "audi" "audi" "audi" ...
 $ model       : chr [1:234] "a4" "a4" "a4" "a4" ...
 $ displacement: num [1:234] 1.8 1.8 2 2 2.8 2.8 3.1 1.8 1.8 2 ...
 $ year        : int [1:234] 1999 1999 2008 2008 1999 1999 2008 1999 1999 2008 ...
 $ cylinders   : int [1:234] 4 4 4 4 6 6 6 4 4 4 ...
 $ transmission: chr [1:234] "auto(l5)" "manual(m5)" "manual(m6)" "auto(av)" ...
 $ drive_train : chr [1:234] "f" "f" "f" "f" ...
 $ city_mpg    : int [1:234] 18 21 20 21 16 18 18 18 16 20 ...
 $ highway_mpg : int [1:234] 29 29 31 30 26 26 27 26 25 28 ...
 $ fuel_type   : chr [1:234] "p" "p" "p" "p" ...
 $ class       : chr [1:234] "compact" "compact" "compact" "compact" ...
#+end_example

* Displacement With Class

  The displacement seems to mostly have a linear relationship with mileage, but there's exceptions, let's see if showing the class of the car reveals any interesting patterns.

#+begin_src R :results output :exports both
unique(mpg$class)
#+end_src

#+RESULTS:
: [1] "compact"    "midsize"    "suv"        "2seater"    "minivan"   
: [6] "pickup"     "subcompact"

